import { Component } from '@angular/core';
import { OwlOptions } from 'ngx-owl-carousel-o';
import { Review } from './../../../../core/interfaces/index';

@Component({
  selector: 'app-reviews-home-page',
  templateUrl: './reviews-home-page.component.html',
  styleUrls: ['./reviews-home-page.component.scss'],
})
export class ReviewsHomePageComponent {
  reviews: Review[] = [
    {
      username: 'Тетяна',
      publicationDate: '12.22.2023',
      content:
        'Магазин килимів - справжнє відкриття! Вражаючий вибір високоякісних килимів, що вражають різноманіттям стилів та дизайнів. Обслуговування на високому рівні, де кожен працівник виявився професіоналом. Вдала покупка перевершила мої очікування - отримав точно те, що шукав. Дякую за приємний досвід покупки, рекомендую цей магазин як надійного партнера у виборі ідеального килима для вашого простору. Неперевершений вибір, висока якість та привітний персонал - ось, що робить цей магазин винятковим. Впевнено рекомендую усім, хто цінує комфорт і стиль у своєму житлі!',
        rating: 5,
      },
    {
      username: 'Тетяна',
      publicationDate: '12.22.2023',
      content:
        'Магазин килимів - справжнє відкриття! Вражаючий вибір високоякісних килимів, що вражають різноманіттям стилів та дизайнів. Обслуговування на високому рівні, де кожен працівник виявився професіоналом. Вдала покупка перевершила мої очікування - отримав точно те, що шукав. Дякую за приємний досвід покупки, рекомендую цей магазин як надійного партнера у виборі ідеального килима для вашого простору. Неперевершений вибір, висока якість та привітний персонал - ось, що робить цей магазин винятковим. Впевнено рекомендую усім, хто цінує комфорт і стиль у своєму житлі!',
        rating: 3,
      },
    {
      username: 'Тетяна',
      publicationDate: '12.22.2023',
      content:
        'Магазин килимів - справжнє відкриття! Вражаючий вибір високоякісних килимів, що вражають різноманіттям стилів та дизайнів. Обслуговування на високому рівні, де кожен працівник виявився професіоналом. Вдала покупка перевершила мої очікування - отримав точно те, що шукав. Дякую за приємний досвід покупки, рекомендую цей магазин як надійного партнера у виборі ідеального килима для вашого простору. Неперевершений вибір, висока якість та привітний персонал - ось, що робить цей магазин винятковим. Впевнено рекомендую усім, хто цінує комфорт і стиль у своєму житлі!',
        rating: 1,
      },
  ];

  // ///////////////////

  imgPath: string = 'assets/img/pages/home/';

  customOptions: OwlOptions = {
    loop: true,
    mouseDrag: true,
    touchDrag: true,
    pullDrag: false,
    dots: false,
    navSpeed: 700,
    navText: [
      `<img src="${
        this.imgPath + 'arrow_carousel.svg'
      }" alt="arrow-left" class="arrow-left"/>`,
      `<img src="${this.imgPath + 'arrow_carousel.svg'}" alt="arrow-right" />`,
    ],
    responsive: {
      0: {
        items: 1,
      },
      400: {
        items: 1,
      },
      740: {
        items: 3,
      },
      940: {
        items: 4,
      },
    },
    nav: true,
  };
}

